УТ_для_edt/src/Catalogs/CRM_УровниПоддержки/CRM_УровниПоддержки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УровниПоддержки</name>
  <predefined>
    <items>
      <name>ПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ВремяРеакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРешения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>CatalogRef.CRM_РежимыРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>Отбор</name>
    <comment>Хранилище отбора для использования в алгоритмах</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборСтрока</name>
    <comment>Представление отбора для отображения в списках</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_УровниПоддержки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Порядок = 0;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Порядок = 0 Тогда
		Порядок = ПолучитьНовоеЗначениеПорядка();
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Отбор") И
		ТипЗнч(ДополнительныеСвойства.Отбор) = Тип("ОтборКомпоновкиДанных") Тогда
		Отбор = Новый ХранилищеЗначения(ДополнительныеСвойства.Отбор, Новый СжатиеДанных(9));
		ОтборСтрока = Строка(Строка(ДополнительныеСвойства.Отбор));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьНовоеЗначениеПорядка()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Таблица.Порядок КАК Порядок
	|ИЗ
	|	Справочник.CRM_УровниПоддержки КАК Таблица
	|ГДЕ
	|	НЕ Таблица.Ссылка = ЗНАЧЕНИЕ(Справочник.CRM_УровниПоддержки.ПоУмолчанию)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат ?(Не ЗначениеЗаполнено(Выборка.Порядок), 1, Выборка.Порядок + 1);
	
КонецФункции

#КонецОбласти

#КонецЕсли
